In [2]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

df1 = pd.read_csv("~/Desktop/Activity-2/df1.csv")
df2 = pd.read_csv("~/Desktop/Activity-2/df2.csv")
df3 = pd.read_csv("~/Desktop/Activity-2/df3.csv")
df4 = pd.read_csv("~/Desktop/Activity-2/df4.csv")
df5 = pd.read_csv("~/Desktop/Activity-2/df5.csv")
df6 = pd.read_csv("~/Desktop/Activity-2/df6.csv")
df7 = pd.read_csv("~/Desktop/Activity-2/df7.csv")
df8 = pd.read_csv("~/Desktop/Activity-2/df8.csv")
df1.head()

       col1     col2
0  272.3966  45.8308
1  272.3288  45.9244
2  272.3307  45.9255
3  272.3711  47.2259
4  272.5282  47.0887

In [ ]:
plt.scatter(df1['col1'],df1['col2'])

In [ ]:
import astropy
from astropy.coordinates import SkyCoord

c_old = SkyCoord([df1['col1'].to_numpy()], [df1['col2'].to_numpy()], frame='icrs',unit='degree') #replace df1 if your variable names are different 
c_new = c_old.galactic
for count in range(len(c_new[0])):
        df1_new_col1 = c_new[0].l.degree
        df1_new_col2 = c_new[0].b.degree
new_data = {'col1':df1_new_col1,'col2':df1_new_col2}
df1_new = pd.DataFrame(new_data)